In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
test = pd.read_csv("C:\\Users\\Elly\\Downloads\\DS_PROJECTS\\test.csv")

test.dropna()
test.isnull.sum()

AttributeError: 'function' object has no attribute 'sum'

In [ ]:
test.head(5)

In [ ]:
test.isnull().sum()

In [ ]:
##test["Dependents"]

In [ ]:
#test.apply(lambda x: sum(x.isnull())) also for iterating through to check missing values

In [ ]:
test.describe()

In [ ]:
test.dtypes

In [ ]:
dict ={"Yes":1 ,"No":0}
test.replace(dict, inplace = True)

In [ ]:
dict2 = {"Male":1 ,"Female":0}
test.replace(dict2, inplace = True)

In [ ]:
dict3= {"Graduate":1 , "Not Graduate":0}
test.replace(dict3 , inplace = True)

In [ ]:
test.iloc[90:91]

In [ ]:
##nans = lambda test: test[test.isnull().any(axis=0)]
##nans(test)

## Replacing Null values when known

In [ ]:
test["Gender"].fillna(1.0, inplace = True)

In [ ]:
test["Self_Employed"].fillna(1.0, inplace = True)

In [ ]:
test["Dependents"].fillna(1.0, inplace = True)

In [ ]:
test["LoanAmount"].fillna(185, inplace = True)

In [ ]:
test["Loan_Amount_Term"].fillna(240, inplace = True)

In [ ]:
test["Credit_History"].fillna(0.0 ,inplace = True)

In [ ]:
##t=['Property_Area']
##test.dropna(t, inplace = True )

In [ ]:
##test1 = pd.read_csv("C:\\Users\\Elly\\Downloads\\DS_PROJECTS\\test_updated.csv" )

In [ ]:
##test1.isnull().sum()

In [ ]:
##test.dropna(axis = 0, how ='all')
##test = test.set_index('Loan_ID' )

test.fillna( 1.0 , inplace = True)
test.head(5)

In [ ]:
test1.to_csv('test_updated.csv')

In [ ]:
test["Credit_History"][10:25]  ##selecting no. of rows of a column
test.fillna(1.0 , inplace= True)

In [ ]:
##test[test["Loan_Amount_Term"]>200][25:40] ##conditioning based on values

In [ ]:
test.dropna(subset = ['Credit_History']).head(5)

In [5]:
test["Credit_History"].isnull().sum()

29

In [6]:
test["Married"].isnull().sum()

0

In [7]:
test.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [8]:
test.dropna(axis = 0, how='all').iloc[240:250]
#nans = lambda test: test[test.isnull().any(axis=0)]
#nans(test)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
240,LP002333,Male,No,0,Not Graduate,No,3844,0,105.0,360.0,1.0,Urban
241,LP002339,Male,Yes,0,Graduate,No,3887,1517,105.0,360.0,0.0,Semiurban
242,LP002344,Male,Yes,0,Graduate,No,3510,828,105.0,360.0,1.0,Semiurban
243,LP002346,Male,Yes,0,Graduate,NaN,2539,1704,125.0,360.0,0.0,Rural
244,LP002354,Female,No,0,Not Graduate,No,2107,0,64.0,360.0,1.0,Semiurban
245,LP002355,NaN,Yes,0,Graduate,No,3186,3145,150.0,180.0,0.0,Semiurban
246,LP002358,Male,Yes,2,Graduate,Yes,5000,2166,150.0,360.0,1.0,Urban
247,LP002360,Male,Yes,NaN,Graduate,No,10000,0,NaN,360.0,1.0,Urban
248,LP002375,Male,Yes,0,Not Graduate,Yes,3943,0,64.0,360.0,1.0,Semiurban
249,LP002376,Male,No,0,Graduate,No,2925,0,40.0,180.0,1.0,Rural

In [9]:
test.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [10]:
test.shape

(367, 12)

In [11]:
test.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban